for (let i = 1; i <= 10; i++) {
    console.log("นับคู่: " + i);
}// นับเลขคู่จาก 1 ถึง 10

for (let i = 1; i <= 10; i++) {
    if (i % 2 === 0) {
        console.log("นับคู่: " + i);
    }
}   // นับเลขคู่จาก 1 ถึง 10 โดยใช้เงื่อนไขตรวจสอบว่าเลขนั้นหารด้วย 2 ลงตัวหรือไม่

for (let i = 5; i <= 7; i++) {
    console.log("สูตรคูณแม่ " + i);

    for (let j = 1; j <= 12; j++) {
        console.log(i + " x " + j + " = " + (i * j));
    }

    console.log("----------------");
}   // แสดงสูตรคูณแม่ 5 ถึง 7 โดยใช้ลูปซ้อน (Nested Loop) เพื่อแสดงผลลัพธ์ของการคูณแต่ละเลขกับตัวเลข 1 ถึง 12

let total = 0;
for (let i = 5; i <= 7; i++) {
    for (let j = 1; j <= 12; j++) {
        total += i * j;
        console.log(`${i} x ${j} = ${i * j} = ${total}`);
    }
}   // คำนวณผลรวมของสูตรคูณแม่ 5 ถึง 7 โดยใช้ลูปซ้อน (Nested Loop) และแสดงผลลัพธ์ของการคูณแต่ละเลขกับตัวเลข 1 ถึง 12 พร้อมกับผลรวมที่เพิ่มขึ้นเรื่อยๆ

for (let i = 0; i <= 50; i+=5) { 
    {
        console.log("นับเลข: " + i);
    }
}   // นับเลขจาก 0 ถึง 50 โดยเพิ่มทีละ 5 และแสดงผลลัพธ์ในแต่ละขั้นตอน